[english]
message = "Hello. Here is the interface in English."
button = "Open File"
image = "Image"
width = "Width"
height = "Height"
prompt = "Select an image file"
error = "Error loading image file, or image file is invalid."

[arabic]
message = "مرحبًا. ها هي الواجهة بالعربية."
button = "افتح ملف"
image = "صورة"
width = "عرض"
height = "ارتفاع"
prompt = "حدد ملف صورة"
error = "خطأ في تحميل ملف الصورة ، أو ملف الصورة غير صالح."

[chinese]
message = "你好。 这是中文（简体）界面。"
button = "打开文件"
image = "图像"
width = "宽度"
height = "高度"
prompt = "选择图像文件"
error = "加载图像文件时出错，或图像文件无效。"

[japanese]
message = "こんにちは。 こちらが日本語のインターフェースです。"
button = "ファイルを開く"
image = "画像"
width = "幅"
height = "身長"
prompt = "画像ファイルを選択してください"
error = "画像ファイルの読み込みエラー、または画像ファイルが無効です。"

[korean]
message = "안녕하세요. 다음은 한국어 인터페이스입니다."
button = "파일 열기"
image = "영상"
width = "너비"
height = "키"
prompt = "이미지 파일 선택"
error = "이미지 파일을 로드하는 중 오류가 발생했거나 이미지 파일이 유효하지 않습니다."

[polish]
message = "Cześć. Oto interfejs w języku polskim."
button = "Otwórz plik"
image = "Obraz"
width = "Szerokość"
height = "Wysokość"
prompt = "Wybierz plik obrazu"
error = "Błąd ładowania pliku obrazu lub plik obrazu jest nieprawidłowy."

[russian]
message = "Привет. Вот интерфейс на русском."
button = "Открыть файл"
image = "Изображение"
width = "Ширина"
height = "Высота"
prompt = "Выберите файл изображения"
error = "Ошибка при загрузке файла изображения или файл изображения недействителен."

[thai]
message = "สวัสดี นี่คืออินเทอร์เฟซภาษาไทย"
button = "เปิดไฟล์"
image = "ภาพ"
width = "ความกว้าง"
height = "ความสูง"
prompt = "เลือกไฟล์รูปภาพ"
error = "เกิดข้อผิดพลาดในการโหลดไฟล์รูปภาพ หรือไฟล์รูปภาพไม่ถูกต้อง"
